tutorials/elastic_cases/coastal_barrier/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (wetting nonWetting);

wetting 
{
    transportModel  Newtonian; 
    nu              [0 2 -1 0 0 0 0] 1e-6; 
    rho             [1 -3 0 0 0 0 0] 1000;
}

nonWetting
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.76e-5; 
    rho             [1 -3 0 0 0 0 0] 1;
}
  
//Solid Phase 
activateSolidMechanics 1;
rho_s           [1 -3 0 0 0 0 0] 2650;  

//Two Phase 
activateCapillarity            1;
alphaSmoothingCoeff            0.5;
activatePorousContactAngle     0;
theta0                         180;

sigma            [1 0 -2 0 0 0 0]  0.077;
invFk0           [0 -2 0 0 0 0 0]  0; // 12/(b^2)

alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;

relativePermeabilityModel  VanGenuchten;
capillarityModel           VanGenuchten;

VanGenuchtenCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 100; //1e3
    m 0.8;
}

pCoeff 0;
// ************************************************************************* //
